#============================================================================
#  String 文本
#----------------------------------------------------------------------------
#  Show_learning 文字 、Player_window 文字
#============================================================================

Show_learning_string = {
     'Initialize' : {
         'title': '魔塔 AI',
         'title1': '機器學習模型',
         'font_style_Chinese': '微軟正黑體',
         'font_style_English': 'Arial'
    },

     'Button_text':{
         'Home':{
             'text_1':'訓練結果',
             'text_2':'返回地圖',
             'text_3':'選擇版本',
             'text_4':'節點版 魔塔',
             'text_5':'  迷宮版 魔塔',
             'text_6':'機器學習模型',
             'text_7':'MCTSfD演算法',
             'text_8':'使用者自行遊玩',
             'text_9':'結束應用程式'
        },
         'build_win':{
              'text_1':'下一層',
              'text_2':'上一層',
              'text_3':'分析圖表',
              'text_4':'訓練結果'
        },
         'select_env':{
              'text_1':'選擇環境',
        },
         'reset':{
              'text_1':'重新選擇演算法',
              'text_2':'重新選擇環境',
              'text_3':'重新選擇版本',

        },
         'universal':{
              'text_1':'確定',
              'text_2':'開啟動畫',
              'text_3':'中止',
              'text_4':'上一層(1F)',
              'text_5':'關閉動畫',
              'text_6':'跳過',
              'text_7':'關閉'

        }
    },
    'label_text':{
         'select_env':{
              'text_1':'選擇地圖',
              'text_2':'學習演算法：',
              'text_3':'訓練次數：',
              'text_4':'Information'
        },
         'demo':{
             'text_1':'建立模型',
             'text_2':'訓練地圖 :',
             'text_3':'測試地圖 :',
             'text_4':'建立資料集與MCTSfD模型',
             'text_5':'訓練模式 :'
        },

         'mlp':{
             'text_1': '第一層神經元:',
             'text_2': '第二層神經元:',
             'text_3': '第三層神經元:',
             'text_4': '訓練回數 :',
             'text_5':'正規化 :'
        },

         'rfc':{
             'text_1':'森林樹木數量:',
             'text_2':'最小樣本區分:',
             'text_3':'RandomState:',
        },

         'BoostTree':{
             'text_1':'森林樹木數量:',
             'text_2':'學習率:',
             'text_3':'最小樣本分割:',
        },

         'svm':{
              'text_1':'Svm_kernel :',
              'text_2':'正規化 :',
        },
         'knn':{
             'text_1':'n_neighbors:',
             'text_2':'Knn weights:',
             'text_3':'KNN algorithm:',
             'text_4':'leaf_size:'
        }
    },

    'scr_text':{
        'create_mota':{
            'text_1':'節點版魔塔環境準備完成\n',
            'text_2':'迷宮版魔塔環境準備完成\n',
            'text_3':'機器學習模型準備完成\n',
            'text_4':'節點版MCTSfD魔塔環境準備完成\n',
            'text_5':'建置完成\n'
            },
        'another':{
            'text_1':'已停止!!!\n',
            'text_2':'訓練\n',
            'text_3':'訓練',
            'text_4':'回，',
            'text_5':'目前最高分數 : 0\n',
            'text_6':'結束訓練\n',
            'text_7':'正在訓練模型，這需要一段時間...\n',
            'text_8':'通關路徑已經儲存\n',
            'text_9':'沒有產生通關路線\n',
            'text_10':'停止訓練不儲存通關路線!!\n'
            },
        'create_model':{
            'text_1':'模型:',
            'text_2':'時間：{:0.3f}',
            'text_3':'結局：',
            'text_4':'分數:' ,
            'text_5':'前進步數:',
            'text_6':'最高樓層:',
            'text_7':'訓練模型:',
            'text_8':'模型訓練完成\n',
            'text_9':'訓練集準確率：{:0.3f}\n',
            'text_10':'測試集準確率：{:0.3f}\n',
            'text_11':'選擇模型 :',
            'text_12':'訓練資料集特徵數據生成中...0%\n',
            'text_13':'訓練資料集特徵數據生成結束\n',
            'text_14':'測試資料集特徵數據生成中...0%\n',
            'text_15':'測試資料集特徵數據生成結束\n',
            'text_16':'選擇訓練模型\n',
            'text_17':'請選擇地圖\n',
            'text_18':'正在訓練',
            'text_19':' 地圖\n',
            'text_20':'預測路線平均正確率:{:0.3f}\n',
            'text_21':'預測花費時間:{:0.3f}秒\n',
            'text_22':'程式進行時間 :',
            'text_23':'正在訓練模型請稍後...\n',
            'text_24':'通關路徑已經儲存\n',
            'text_25':'沒有產生通關路線\n',
            'text_26':'可以關閉此視窗!!\n',
            'text_27':'正在建立MCTSfD演算法\n'
            }
        },

    'messagebox_text':{
        'title':{
            'text_1':'警告'
            },
        'message':{
            'text_1':'請選擇地圖',
            'text_2':'請選擇演算法與輸入訓練次數',
            'text_3':'請選擇模型',
            'text_4':'請輸入超參數',
            'text_5':'請選擇訓練資料與測試資料地圖',
            'text_6':'此地圖沒有通關路線，可以通過自行遊玩或是節點版生成'
            }
        },

    'tips_text':{
        'text_1':'請點選版本',
        'text_2':'將遊戲中的事件節點抽取出來，建立成節點與節點相鄰的網路拓樸，大幅簡化遊戲地圖結構',
        'text_3':'模擬原來遊戲地圖的特徵與結構，讓代理在這個環境中探索',
        'text_4':'利用節點版進行模型預測\n模型包含:感知機, 隨機森林, 梯度提升樹, Svm, Knn',
        'text_5':'隨機森林結合蒙地卡羅搜尋的演算法\nP.S.可將24層魔塔通關',
        'text_6':'使用者可自行遊玩代理所學習的地圖',
        'text_7':'退出應用程式',
        'text_8':'切換至下一個樓層',
        'text_9':'切換至上一個樓層',
        'text_10':'查看演算法訓練結果',
        'text_11':'點擊可重新選擇地圖',
        'text_12':'整體神經網路每層神經元顆數及訓練回數',
        'text_13':'森林樹木數量:森林裡樹木的數量 \n最小樣本區分:區分最低分裂數 \n RandomState:隨機程度',
        'text_14':'森林樹木數量:森林裡樹木的數量\n 學習率:學習速率\n',
        'text_15':'若過凝合 可適用L2或L1正規化',
        'text_16':'n_neighbors:問題點最近的多少個最近鄰 \n KNN algorithm:ball_tree是另一種基於樹狀結構的kNN算法，則是最直接的蠻力計算\n weights:近鄰附上的權重\n leaf_size:生成樹葉點\n',
        'text_17':'節點版是為了紀錄玩家的通關路線，會將導致死亡的節點移除',
        'text_18':'迷宮版和普通魔塔一樣，可以自由探索，不會將導致死亡的節點移除',
        'text_19':'訓練模式\n單一地圖 : 只會將此訓練地圖的最高分數通關路線帶進去訓練\n強化地圖 : 會將資料夾中所有此訓練地圖的通關路線帶進去訓練\n強化泛化 : 會將資料夾中所有地圖的通關路線帶進去訓練',
        'text_20':'選擇不同的模型訓練地圖'
        }
}


Player_window_string={
    'Initialize' : {
         'title': '使用者遊玩',
         'font_style_Chinese': '微軟正黑體'
    },
    'Button_text':{
       'text_1':'開始遊戲',
       'text_2':'節點版 魔塔',
       'text_3':'迷宮版 魔塔',
       'text_4':'下一層',
       'text_5':'上一層',
       'text_6':'選擇地圖',
       'text_7':'Information',
       'text_8':'怪物資訊',
       'text_9':'樓層資訊',
       'text_10':'返回遊戲畫面',
       'text_11':'下一層',
       'text_12':'上一層',
       'text_13':'確定',
       'text_14':'開始',
       'text_15':'停止遊戲',
       'text_16':'離開遊戲',
       'text_17':'節點編號'
    },
    'info_scr':{
       'text_1':'自行遊玩載入完成，此為迷宮模式\n',
       'text_2':'自行遊玩載入完成，此為節點模式\n',
       'text_3':'地圖載入完成\n',
       'text_4':'遊戲開始\n',
       'text_5':'節點編號 \t ',
       'text_6':'節點位置 \t ',
       'text_7':'節點名稱\n',
       'text_8':'遊玩路徑已經儲存!!\n'
    },
    'messagebox_text':{
        'titel':{
            'text_1':'提示',
            'text_2':'警告'
            },
        'message':{
            'text_1':'確認購買',
            'text_2':'取消購買',
            'text_3':'過關',
            'text_4':'死亡'
            }
       }
}




